Tekla Open API Reference for Tekla Structures 2025
DotPrintAreaType Enumeration
 The print area type.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum DotPrintAreaType
Public Enumeration DotPrintAreaType
Members
Member name | Value | Description
EntireDrawing | 0 |  Print entire drawing.
VisibleArea | 1 |  Print visible area.
See Also
Reference
Tekla.Structures.Drawing Namespace